<a href="https://colab.research.google.com/github/sdmadhav/ML-Project/blob/main/Madhav_Shivaji_Deshatwad_assignment6.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 1. Database Creation (1.5 Marks)
## 1. Create a database named IIT Palakkad and the following tables with at least 10 entries each:
> student (id, name, dept_name, gate_score, cgpa)
>
> assistant (id, course_id, sec_id, sem, year)
>
> course (course_name, course_id, credit, dept_name)
* Choices:
>
> dept_name = ("DS", "PEPS", "SOCD")
>
> sem = (1, 2, 3, 4)
>
>  year = (2023, 2024)
>
> credit = (3, 4, 5)
>
>  gate_score is out of 1000

```sql
create database iit_palakkad;
```
![alt text](./1.png "OUTPUT")

```sql

create table student (
    id SERIAL PRIMARY KEY NOT NULL,
    name VARCHAR(50) NOT NULL,
    dept_name VARCHAR(10) CHECK (dept_name IN ('DS', 'PEPS', 'SOCD')) NOT NULL,
    gate_score INT CHECK (gate_score BETWEEN 0 AND 1000) NOT NULL,
    cgpa DECIMAL(3, 2) NOT NULL
);


create table assistant (
    id INT NOT NULL,
    course_id INT NOT NULL,
    sec_id VARCHAR(5) NOT NULL,
    sem INT CHECK (sem IN (1, 2, 3, 4)) NOT NULL,
    year INT CHECK (year IN (2023, 2024)) NOT NULL,
    FOREIGN KEY (id) REFERENCES student(id)
);


create table course (
    course_name VARCHAR(100) NOT NULL,
    course_id INT PRIMARY KEY NOT NULL,
    credit INT CHECK (credit IN (3, 4, 5)) NOT NULL,
    dept_name VARCHAR(10) CHECK (dept_name IN ('DS', 'PEPS', 'SOCD')) NOT NULL
);

```

![alt text](/content/2.png "OUTPUT")

```sql

insert into student (name, dept_name, gate_score, cgpa) VALUES
('Madhav', 'DS', 800, 8.5),
('Basvesh', 'PEPS', 700, 7.8),
('Shiva', 'SOCD', 650, 7.3),
('Prem', 'DS', 850, 9.0),
('Juli', 'PEPS', 780, 8.1),
('Sam', 'SOCD', 720, 8.4),
('Adi', 'DS', 700, 9.5),
('Jay', 'PEPS', 680, 7.0),
('Aish', 'SOCD', 600, 6.8),
('Moore', 'DS', 820, 8.7),
('Kumar', 'DS', 780, 8.2),
('Leela', 'PEPS', 830, 8.6),
('Mohan', 'SOCD', 620, 7.0),
('Nina', 'DS', 870, 9.2),
('Oscar', 'PEPS', 750, 8.0),
('Priya', 'SOCD', 680, 7.4),
('Raj', 'DS', 910, 9.8),
('Sara', 'PEPS', 720, 7.5),
('Tina', 'SOCD', 640, 7.2),
('Umesh', 'DS', 760, 8.0);

```
![alt text](/content/3.png "OUTPUT")

```sql

insert into assistant (id, course_id, sec_id, sem, year) VALUES
(1, 101, 'A', 2, 2023),
(2, 102, 'B', 1, 2024),
(3, 103, 'C', 3, 2023),
(1, 101, 'A', 2, 2024),
(4, 104, 'D', 4, 2023),
(5, 102, 'B', 2, 2023),
(6, 103, 'C', 2, 2024),
(7, 104, 'D', 3, 2023),
(8, 105, 'E', 1, 2024),
(9, 101, 'A', 3, 2023),
(10, 104, 'D', 4, 2024),
(5, 105, 'E', 2, 2023),
(6, 101, 'A', 1, 2023);

```

![alt text](/content/4.png "OUTPUT")

```sql
insert into course (course_name, course_id, credit, dept_name) VALUES
('Power Systems', 102, 5, 'PEPS'),
('Electrical Engineering', 110, 5, 'PEPS'),
('Quantum Computing', 107, 4, 'PEPS'),
('Engineering Ethics', 105, 4, 'PEPS'),
('Sociology of Technology', 103, 3, 'SOCD'),
('Ethics and Society', 108, 3, 'SOCD'),
('AI and Machine Learning', 106, 5, 'DS'),
('Advanced Data Science', 104, 4, 'DS'),
('Data Analytics', 109, 4, 'DS'),
('Data Science Basics', 101, 4, 'DS');

```
![alt text](/content/5.png "OUTPUT")

## 2. Write queries to display each of the individual tables (student, assistant, and course) in full.
```sql
SELECT * FROM student;

```
![alt text](/content//content/6.png "OUTPUT")

```sql
SELECT * FROM assistant;

```
![alt text](/content/7.png "OUTPUT")

```sql
SELECT * FROM course;
```
![alt text](/content/8.png "OUTPUT")

# 2. Retrieve DS Students with High CGPA (0.5 Marks)
## 1. Retrieve the names of all students in the DS department who have a CGPA greater than 8.

```sql
select name
from student
where dept_name ='DS' and cgpa > 8;

```
![alt text](/content//content/9.png "OUTPUT")
## 2. Modify the query to include only students who also have a gate score greater than 750

```sql
select name
from student
where dept_name = 'DS' and cgpa > 8 and gate_score > 750;

```
![alt text](/content/10.png "OUTPUT")

# 3. Courses Taught in Semester 2 (2023) (0.5 Marks)
## 1. Retrieve the course IDs of the courses being taught in semester 2 during the year 2023

```sql
SELECT course_id
FROM assistant
WHERE sem = 2 AND year = 2023;

```
![alt text](/content//content/11.png "OUTPUT")

## 2. Also retrieve the course names along with their course IDs for courses being taught in semester 2 of the year 2023.

```sql
select course_name, course_id
from course
where course_id in (SELECT course_id
FROM assistant
WHERE sem = 2 AND year = 2023);

```
![alt text](/content/12.png "OUTPUT")

# 4. Department-wise Student Count and Average Gate Score (1 Marks)
## 1. Write a query to list the number of students and the average gate score for each department, sorted in ascending order by the number of students.

```sql
select dept_name, count(*) as student_count, avg(gate_score)
from student
group by dept_name
order by student_count asc;

```
![alt text](/content//content/13.png "OUTPUT")


## 2. Additionally, filter out departments where the number of students is less than 5.
```sql
select dept_name, count(*) as student_count, avg(gate_score)
from student
group by dept_name
having count(*) < 5
order by student_count asc;

```
![alt text](/content/14.png "OUTPUT")

# 5. Students Serving as Teaching Assistants (0.75 Marks)

### 1.  Retrieve the names of students along with their departments who are teaching assistants in semester 2, sorted in reverse alphabetical order by name.

```sql
select distinct(name), dept_name
from student
join assistant on student.id = assistant.id
where assistant.sem=2 and assistant.year=2024
order by name desc;

```
![alt text](/content//content/15.png "OUTPUT")


### 2.  Modify the query to only include teaching assistants who are assisting in courses with a credit of 4 or more.

```sql
select distinct(name), s.dept_name
from student as s
join assistant as a on s.id = a.id
join course as c on a.course_id = c.course_id
where c.credit >= 4 and a.sem=2 and a.year=2024
order by name desc;

```
![alt text](/content/16.png "OUTPUT")

# 6. Teaching Assistants for 4+ Credit Courses (0.75 Marks)

### 1. Retrieve the names of students, along with the courses they are assisting in, for courses that have at least 4 credits.

```sql
SELECT student.name, course.course_name
FROM student
JOIN assistant ON student.id = assistant.id
JOIN course ON assistant.course_id = course.course_id
WHERE course.credit >= 4 and assistant.year = 2024;

```
![output](/content//content/17.png 'output')


### 2. Add the department name of each student to the query results.

```sql
SELECT student.name, course.course_name, student.dept_name
FROM student
JOIN assistant ON student.id = assistant.id
JOIN course ON assistant.course_id = course.course_id
WHERE course.credit >= 4 and assistant.year = 2024;

```
![output](/content/18.png 'output')

# 7. Nested Query for Department-wise Average Gate Score (1.5 Marks)

### 1. Use a nested query in the FROM clause to retrieve the names of departments along with their average gate scores, where the average gate score is greater than 500.

```sql
select dept_name, average_score
from (
select dept_name, avg(gate_score) as average_score
from student
group by dept_name
) as new
where average_score>500;

```
![output](/content//content/19.png 'output')


### 2. Extend the query to show both the total number of students and the average CGPA for each department, along with the average gate score.

```sql
select dept_name, average_score,num_of_stud, average_cgpa
from (
select dept_name, count(id) as num_of_stud, avg(gate_score) as average_score, avg(cgpa) as average_cgpa
from student
group by dept_name
) as new
where average_score>500;

```
![output](/content/20.png 'output')